---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.SubDivisionPhaseMismatch
source: html/e8d845a6-4c54-aba8-1ff7-7d51189c2874.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.SubDivisionPhaseMismatch Property

Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid.

## Syntax (C#)
```csharp
public static FailureDefinitionId SubDivisionPhaseMismatch { get; }
```